Revit 2027 API
DuctFittingAndAccessoryConnectorData.Height Property
 The connector height, Units:(ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
public:
property double Height {
	double get ();
}
member Height : float with get
Property Value
Double
See Also
Reference
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace